////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Define Paramerter Version
////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#define PARAMETER_VERSION "V2.2.4"

// YJ 5600 파라메터...  엔코더 값이 음수인 경우 
#define D1_LOW_5600 1100  //860
#define D1_MAX_5600 1440 //1085
#define D2_LOW_5600 400  //290
#define D2_MAX_5600 1000  //400

// 엔코더 값이 양수 인 경우 
#define positive_D1_LOW_5600 7600  //860
#define positive_D1_MAX_5600 8000 //1085
#define positive_D2_LOW_5600 7000  //290
#define positive_D2_MAX_5600 7400  //400

// YJ 7000 파라메터...
#define D1_LOW_7000 860  //860
#define D1_MAX_7000 1085 //1085
#define D2_LOW_7000 290  //290
#define D2_MAX_7000 400  //400

// 모델 공통 파라메터
#define Chk_Point 390 // 390 * 50ms = 19.50sec